In [1]:
import matplotlib.pyplot as plt
import pandas as pd

Source:India Meterological Department/Ministry of Earth Science/Govt. of india

In [2]:
data = pd.read_excel('data/daily.xlsx')

In [3]:
!pip3 install xlrd

Collecting xlrd
  Downloading https://files.pythonhosted.org/packages/b0/16/63576a1a001752e34bf8ea62e367997530dc553b689356b9879339cf45a4/xlrd-1.2.0-py2.py3-none-any.whl (103kB)
    100% |████████████████████████████████| 112kB 4.0MB/s ta 0:00:01
Installing collected packages: xlrd
Successfully installed xlrd-1.2.0

In [3]:
data

,rainfall (mm/day),PET (mm/day),Q (mm/day),avg Temperature,Date,Unnamed: 5,Unnamed: 6
0,NaN,NaN,NaN,NaN,1951,1,1
1,NaN,NaN,NaN,NaN,1951,1,2
2,NaN,NaN,NaN,NaN,1951,1,3
3,NaN,NaN,NaN,NaN,1951,1,4
4,NaN,NaN,NaN,NaN,1951,1,5
...,...,...,...,...,...,...,...
23371,0.0,3.646389,0.033444,19.805,2014,12,27
23372,0.0,3.794536,0.032650,19.525,2014,12,28
23373,0.0,3.897361,0.031907,19.535,2014,12,29
23374,0.0,3.752435,0.031208,19.695,2014,12,30
23375,0.0,3.521435,0.000000,20.730,2014,12,31

In [4]:
data.columns

Index(['rainfall (mm/day)', 'PET (mm/day)', 'Q (mm/day)', 'avg Temperature',
       'Date ', 'Unnamed: 5', 'Unnamed: 6'],
      dtype='object')

About variables:
Rainfall:
PET
Q
avg Temp
Date

In [45]:
data.columns = ['Rainfall', 'PET (mm/day)', 'Q (mm/day)', 'Temperature',
       'Year', 'Month', 'Day']

In [46]:
data.head(2)

   Rainfall  PET (mm/day)  Q (mm/day)  Temperature  Year  Month  Day
0       NaN           NaN         NaN          NaN  1951      1    1
1       NaN           NaN         NaN          NaN  1951      1    2

In [47]:
req_data = data[['Rainfall','Temperature',
       'Year', 'Month', 'Day']]

In [50]:
df = req_data.loc[req_data['Year'] != 1951]

In [51]:
df

       Rainfall  Temperature  Year  Month  Day
365         0.0       21.140  1952      1    1
366         0.0       21.085  1952      1    2
367         0.0       21.020  1952      1    3
368         0.0       21.145  1952      1    4
369         0.0       21.390  1952      1    5
...         ...          ...   ...    ...  ...
23371       0.0       19.805  2014     12   27
23372       0.0       19.525  2014     12   28
23373       0.0       19.535  2014     12   29
23374       0.0       19.695  2014     12   30
23375       0.0       20.730  2014     12   31

[23011 rows x 5 columns]

       Temperature
365         21.140
366         21.085
367         21.020
368         21.145
369         21.390
...            ...
23371       19.805
23372       19.525
23373       19.535
23374       19.695
23375       20.730

[23011 rows x 1 columns]

In [59]:
df = df.round({"Rainfall":2, "Temperature":2})

In [60]:
df

       Rainfall  Temperature  Year  Month  Day
365         0.0        21.14  1952      1    1
366         0.0        21.08  1952      1    2
367         0.0        21.02  1952      1    3
368         0.0        21.14  1952      1    4
369         0.0        21.39  1952      1    5
...         ...          ...   ...    ...  ...
23371       0.0        19.80  2014     12   27
23372       0.0        19.52  2014     12   28
23373       0.0        19.54  2014     12   29
23374       0.0        19.70  2014     12   30
23375       0.0        20.73  2014     12   31

[23011 rows x 5 columns]

In [67]:
gb_df = df.groupby(['Year', 'Month'])

In [79]:
agg_df = gb_df.mean()

In [85]:
agg_df

            Rainfall  Temperature   Day
Year Month
1952 1      0.000000    22.002258  16.0
     2      0.016552    24.064138  15.0
     3      0.000000    25.797742  16.0
     4      0.139333    29.878000  15.5
     5      0.034194    31.059677  16.0
...              ...          ...   ...
2014 8      7.839032    26.130000  16.0
     9      3.962000    26.019000  15.5
     10     0.899677    27.110323  16.0
     11     1.138000    25.014667  15.5
     12     0.241613    21.644839  16.0

[756 rows x 3 columns]

In [97]:
agg_df = agg_df[['Rainfall','Temperature']]

In [98]:
agg_df.to_csv('monthly.csv')

In [99]:
agg_df_by_year = agg_df.groupby(['Year'])

In [100]:
file2 = agg_df_by_year.mean()

In [101]:
file2.to_csv('yearly.csv')

In [96]:
file2

      Rainfall  Temperature
Year
1952  1.229979    25.866128
1953  1.351036    25.916756
1954  1.606825    25.435058
1955  1.496951    25.582741
1956  2.435259    25.356322
...        ...          ...
2010  2.505376    26.490292
2011  1.230798    25.841286
2012  1.450617    25.712913
2013  1.912186    25.722776
2014  1.838397    26.174831

[63 rows x 2 columns]

In [102]:
hist = file2.hist(bins=3)

ModuleNotFoundError: No module named 'matplotlib'